#Загадай число. Комп загадывает число от 1 до 100. 
# У вас три попытки. Комп ждем ваши вариант, если угадал - игра заканчивается. 
# Комп говорит больше / меньше

# i = 0
# magic_number = rand(100)

# while i <= 3
#   puts "Загадайте число:"
#   number = gets.to_i
#   if number == magic_number
#     'Вы угадали !'
#   elsif number > magic_number
#     "Число должно быть меньше/n Попробуйте еще раз:"
#   else
#     "Число должно быть больше/n Попробуйте еще раз:"
#   end
#   i += 1
# end

# puts "Число, которое загадал комп #{magic_number}"
